RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_tim_ex.h
/**
  ******************************************************************************
  * @file    stm32h7rsxx_hal_tim_ex.h
  * @author  MCD Application Team
  * @brief   Header file of TIM HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7RSxx_HAL_TIM_EX_H
#define STM32H7RSxx_HAL_TIM_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_hal_def.h"

/** @addtogroup STM32H7RSxx_HAL_Driver
  * @{
  */

/** @addtogroup TIMEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup TIMEx_Exported_Types TIM Extended Exported Types
  * @{
  */

/**
  * @brief  TIM Hall sensor Configuration Structure definition
  */

typedef struct
{
  uint32_t IC1Polarity;         /*!< Specifies the active edge of the input signal.
                                     This parameter can be a value of @ref TIM_Input_Capture_Polarity */

  uint32_t IC1Prescaler;        /*!< Specifies the Input Capture Prescaler.
                                     This parameter can be a value of @ref TIM_Input_Capture_Prescaler */

  uint32_t IC1Filter;           /*!< Specifies the input capture filter.
                                     This parameter can be a number between Min_Data = 0x0 and Max_Data = 0xF */

  uint32_t Commutation_Delay;   /*!< Specifies the pulse value to be loaded into the Capture Compare Register.
                                     This parameter can be a number between Min_Data = 0x0000 and Max_Data = 0xFFFF */
} TIM_HallSensor_InitTypeDef;

/**
  * @brief  TIM Break/Break2 input configuration
  */
typedef struct
{
  uint32_t Source;         /*!< Specifies the source of the timer break input.
                                This parameter can be a value of @ref TIMEx_Break_Input_Source */
  uint32_t Enable;         /*!< Specifies whether or not the break input source is enabled.
                                This parameter can be a value of @ref TIMEx_Break_Input_Source_Enable */
  uint32_t Polarity;       /*!< Specifies the break input source polarity.
                                This parameter can be a value of @ref TIMEx_Break_Input_Source_Polarity */
} TIMEx_BreakInputConfigTypeDef;

/**
  * @brief  TIM Encoder index configuration
  */
typedef struct
{
  uint32_t Polarity;                  /*!< TIM Encoder index polarity.This parameter can be a value of @ref TIMEx_Encoder_Index_Polarity */

  uint32_t Prescaler;                 /*!< TIM Encoder index prescaler.This parameter can be a value of @ref TIMEx_Encoder_Index_Prescaler */

  uint32_t Filter;                    /*!< TIM Encoder index filter.This parameter can be a number between Min_Data = 0x0 and Max_Data = 0xF */

  uint32_t  Blanking;                 /*!< Specifies whether or not the encoder index event is conditioned by TI3 or TI4 input.This parameter can be a value of @ref TIMEx_Encoder_Index_Blanking */

  FunctionalState  FirstIndexEnable;  /*!< Specifies whether or not the encoder first index is enabled.This parameter value can be ENABLE or DISABLE. */

  uint32_t Position;                  /*!< Specifies in which AB input configuration the index event resets the counter.This parameter can be a value of @ref TIMEx_Encoder_Index_Position */

  uint32_t Direction;                 /*!< Specifies in which counter direction the index event resets the counter.This parameter can be a value of @ref TIMEx_Encoder_Index_Direction */

} TIMEx_EncoderIndexConfigTypeDef;

/**
  * @}
  */
/* End of exported types -----------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup TIMEx_Exported_Constants TIM Extended Exported Constants
  * @{
  */

/** @defgroup TIMEx_Remap TIM Extended Remapping
  * @{
  */
#define TIM_TIM1_ETR_GPIO           0x00000000UL                                                /*!< TIM1_ETR is not connected to I/O      */
#define TIM_TIM1_ETR_ADC1_AWD1      (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                       /*!< TIM1_ETR is connected to ADC1 AWD1    */
#define TIM_TIM1_ETR_ADC1_AWD2      (TIM_AF1_ETRSEL_2)                                          /*!< TIM1_ETR is connected to ADC1 AWD2    */
#define TIM_TIM1_ETR_ADC1_AWD3      (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                       /*!< TIM1_ETR is connected to ADC1 AWD3    */
#define TIM_TIM1_ETR_ADC2_AWD1      (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                       /*!< TIM1_ETR is connected to ADC2 AWD1    */
#define TIM_TIM1_ETR_ADC2_AWD2      (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)    /*!< TIM1_ETR is connected to ADC2 AWD2    */
#define TIM_TIM1_ETR_ADC2_AWD3      (TIM_AF1_ETRSEL_3)                                          /*!< TIM1_ETR is connected to ADC2 AWD3    */

#define TIM_TIM2_ETR_GPIO           0x00000000UL                                                /*!< TIM2_ETR is not connected to I/O      */
#define TIM_TIM2_ETR_DCMIPP_HSYNC   (TIM_AF1_ETRSEL_0)                                          /*!< TIM2_ETR is connected to DCMIPP HSYNC */
#define TIM_TIM2_ETR_LTDC_HSYNC     (TIM_AF1_ETRSEL_1)                                          /*!< TIM2_ETR is connected to LTDC HSYNC   */
#define TIM_TIM2_ETR_SAI1_FSA       (TIM_AF1_ETRSEL_2)                                          /*!< TIM2_ETR is connected to SAI1 FS_A    */
#define TIM_TIM2_ETR_SAI1_FSB       (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)                       /*!< TIM2_ETR is connected to SAI1 FS_B    */
#define TIM_TIM2_ETR_GFXTIM_TE      (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                       /*!< TIM2_ETR is connected to GFXTIM TE    */
#define TIM_TIM2_ETR_DCMIPP_VSYNC   (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)    /*!< TIM2_ETR is connected to DCMIPP VSYNC */
#define TIM_TIM2_ETR_LTDC_VSYNC     (TIM_AF1_ETRSEL_3)                                          /*!< TIM2_ETR is connected to LTDC VSYNC   */
#define TIM_TIM2_ETR_TIM3_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1)                       /*!< TIM2_ETR is connected to TIM3 ETR     */
#define TIM_TIM2_ETR_TIM4_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)    /*!< TIM2_ETR is connected to TIM4 ETR     */
#define TIM_TIM2_ETR_TIM5_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2)                       /*!< TIM2_ETR is connected to TIM5 ETR     */
#define TIM_TIM2_ETR_ETH_PPS        (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)    /*!< TIM2_ETR is connected to ETH PPS      */

#define TIM_TIM3_ETR_GPIO           0x00000000UL                                                /*!< TIM3_ETR is not connected to I/O      */
#define TIM_TIM3_ETR_DCMIPP_HSYNC   (TIM_AF1_ETRSEL_0)                                          /*!< TIM3_ETR is connected to DCMIPP HSYNC */
#define TIM_TIM3_ETR_LTDC_HSYNC     (TIM_AF1_ETRSEL_1)                                          /*!< TIM3_ETR is connected to LTDC HSYNC   */
#define TIM_TIM3_ETR_GFXTIM_TE      (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                       /*!< TIM3_ETR is connected to GFXTIM TE    */
#define TIM_TIM3_ETR_DCMIPP_VSYNC   (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)    /*!< TIM3_ETR is connected to DCMIPP VSYNC */
#define TIM_TIM3_ETR_LTDC_VSYNC     (TIM_AF1_ETRSEL_3)                                          /*!< TIM3_ETR is connected to LTDC VSYNC   */
#define TIM_TIM3_ETR_TIM2_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                       /*!< TIM3_ETR is connected to TIM2 ETR     */
#define TIM_TIM3_ETR_TIM4_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)    /*!< TIM3_ETR is connected to TIM4 ETR     */
#define TIM_TIM3_ETR_TIM5_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2)                       /*!< TIM3_ETR is connected to TIM5 ETR     */
#define TIM_TIM3_ETR_ETH_PPS        (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_0)    /*!< TIM3_ETR is connected to ETH PPS      */

#define TIM_TIM4_ETR_GPIO           0x00000000UL                                                /*!< TIM4_ETR is not connected to I/O      */
#define TIM_TIM4_ETR_DCMIPP_HSYNC   (TIM_AF1_ETRSEL_0)                                          /*!< TIM4_ETR is connected to DCMIPP HSYNC */
#define TIM_TIM4_ETR_LTDC_HSYNC     (TIM_AF1_ETRSEL_1)                                          /*!< TIM4_ETR is connected to LTDC HSYNC   */
#define TIM_TIM4_ETR_GFXTIM_TE      (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                       /*!< TIM4_ETR is connected to GFXTIM TE    */
#define TIM_TIM4_ETR_DCMIPP_VSYNC   (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)    /*!< TIM4_ETR is connected to DCMIPP VSYNC */
#define TIM_TIM4_ETR_LTDC_VSYNC     (TIM_AF1_ETRSEL_3)                                          /*!< TIM4_ETR is connected to LTDC VSYNC   */
#define TIM_TIM4_ETR_TIM2_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                       /*!< TIM4_ETR is connected to TIM2 ETR     */
#define TIM_TIM4_ETR_TIM3_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1)                       /*!< TIM4_ETR is connected to TIM3 ETR     */
#define TIM_TIM4_ETR_TIM5_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_2)                       /*!< TIM4_ETR is connected to TIM5 ETR     */

#define TIM_TIM5_ETR_GPIO           0x00000000UL                                                /*!< TIM5_ETR is not connected to I/O      */
#define TIM_TIM5_ETR_SAI2_FSA       (TIM_AF1_ETRSEL_0)                                          /*!< TIM5_ETR is connected to SAI2 FS_A    */
#define TIM_TIM5_ETR_SAI2_FSB       (TIM_AF1_ETRSEL_1)                                          /*!< TIM5_ETR is connected to SAI2 FS_B    */
#define TIM_TIM5_ETR_DCMIPP_HSYNC   (TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)                       /*!< TIM5_ETR is connected to DCMIPP HSYNC */
#define TIM_TIM5_ETR_LTDC_HSYNC     (TIM_AF1_ETRSEL_2)                                          /*!< TIM5_ETR is connected to LTDC HSYNC   */
#define TIM_TIM5_ETR_GFXTIM_TE      (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1)                       /*!< TIM5_ETR is connected to GFXTIM TE    */
#define TIM_TIM5_ETR_DCMIPP_VSYNC   (TIM_AF1_ETRSEL_2 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)    /*!< TIM5_ETR is connected to DCMIPP VSYNC */
#define TIM_TIM5_ETR_LTDC_VSYNC     (TIM_AF1_ETRSEL_3)                                          /*!< TIM4_ETR is connected to LTDC VSYNC   */
#define TIM_TIM5_ETR_TIM2_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_0)                       /*!< TIM5_ETR is connected to TIM2 ETR     */
#define TIM_TIM5_ETR_TIM3_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1)                       /*!< TIM5_ETR is connected to TIM3 ETR     */
#define TIM_TIM5_ETR_TIM4_ETR       (TIM_AF1_ETRSEL_3 | TIM_AF1_ETRSEL_1 | TIM_AF1_ETRSEL_0)    /*!< TIM5_ETR is connected to TIM4 ETR     */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input TIM Extended Break input
  * @{
  */
#define TIM_BREAKINPUT_BRK     0x00000001U                                      /*!< Timer break input  */
#define TIM_BREAKINPUT_BRK2    0x00000002U                                      /*!< Timer break2 input */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source TIM Extended Break input source
  * @{
  */
#define TIM_BREAKINPUTSOURCE_BKIN     0x00000001U                               /*!< An external source (GPIO) is connected to the BKIN pin  */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source_Enable TIM Extended Break input source enabling
  * @{
  */
#define TIM_BREAKINPUTSOURCE_DISABLE     0x00000000U                            /*!< Break input source is disabled */
#define TIM_BREAKINPUTSOURCE_ENABLE      0x00000001U                            /*!< Break input source is enabled */
/**
  * @}
  */

/** @defgroup TIMEx_Break_Input_Source_Polarity TIM Extended Break input polarity
  * @{
  */
#define TIM_BREAKINPUTSOURCE_POLARITY_LOW     0x00000001U                       /*!< Break input source is active low */
#define TIM_BREAKINPUTSOURCE_POLARITY_HIGH    0x00000000U                       /*!< Break input source is active_high */
/**
  * @}
  */

/** @defgroup TIMEx_Timer_Input_Selection TIM Extended Timer input selection
  * @{
  */
#define TIM_TIM2_TI1_GPIO                          0x00000000UL                                                   /*!< TIM2_TI1 is connected to GPIO */
#define TIM_TIM2_TI1_ETH_PPS                       TIM_TISEL_TI1SEL_0                                             /*!< TIM2 TI1 is connected to ETH1 PPS */

#define TIM_TIM3_TI1_GPIO                          0x00000000UL                                                   /*!< TIM3_TI1 is connected to GPIO */
#define TIM_TIM3_TI1_ETH_PPS                       TIM_TISEL_TI1SEL_0                                             /*!< TIM3 TI1 is connected to ETH1 PPS */

#define TIM_TIM9_TI1_GPIO                          0x00000000UL                                                   /*!< TIM9_TI1 is connected to GPIO */
#define TIM_TIM9_TI1_MCO1                          (TIM_TISEL_TI1SEL_2)                                           /*!< TIM9_TI1 is connected to MCO1 */
#define TIM_TIM9_TI1_MCO2                          (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                      /*!< TIM9_TI1 is connected to MCO2 */

